In [51]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot

In [16]:
data = pd.read_csv("Traffic_Violations_2.csv")

In [65]:
#data[data['Belts'] == 'Yes']
#data.groupby(['Race']).agg(['count'])
d = data.value_counts(['Arrest Type']).reset_index(name='c')
d

                               Arrest Type       c
0                        A - Marked Patrol  192287
1                         Q - Marked Laser   34393
2                      B - Unmarked Patrol   10526
3            S - License Plate Recognition    4158
4                          O - Foot Patrol    3565
5                           L - Motorcycle    3033
6              E - Marked Stationary Radar    1781
7     G - Marked Moving Radar (Stationary)    1519
8                       R - Unmarked Laser    1237
9         I - Marked Moving Radar (Moving)     617
10                   M - Marked (Off-Duty)     333
11  H - Unmarked Moving Radar (Stationary)     248
12           F - Unmarked Stationary Radar     233
13      J - Unmarked Moving Radar (Moving)     143
14                       C - Marked VASCAR      76
15                 N - Unmarked (Off-Duty)      47
16                      P - Mounted Patrol      31
17                     D - Unmarked VASCAR      20
18                     K - Aircraft Assist      11

In [64]:
len(data['Charge'].unique())

737

In [66]:
gender = data.value_counts(['Gender']).reset_index(name='count')
gender

  Gender   count
0      M  174761
1      F   79380
2      U     117

In [67]:
race = data.value_counts(['Race']).reset_index(name='count')
race

              Race  count
0            WHITE  89583
1            BLACK  79437
2         HISPANIC  58224
3            ASIAN  13531
4            OTHER  13055
5  NATIVE AMERICAN    428

In [68]:
model = data.value_counts(['Model']).reset_index(name='count')
model

                Model  count
0                  4S  27217
1                  TK  16260
2              ACCORD   9363
3               CIVIC   8829
4               CAMRY   7818
...               ...    ...
6324  E-350 SUPER DUT      1
6325      E-350 - VAN      1
6326        E-250 VAN      1
6327              SRV      1
6328              `TC      1

[6329 rows x 2 columns]

In [71]:
make = data.value_counts(['Make']).reset_index(name='count')
make.head(20)

         Make  count
0       HONDA  27738
1      TOYOTA  27619
2        FORD  24727
3      NISSAN  13887
4        TOYT  13176
5        HOND   8829
6        CHEV   7588
7       DODGE   7224
8         BMW   7215
9       CHEVY   6385
10  CHEVROLET   5901
11      ACURA   5883
12       JEEP   5716
13       NISS   5437
14    HYUNDAI   4822
15      LEXUS   3927
16      MAZDA   3775
17       MERZ   3657
18        GMC   3460
19        KIA   3377

In [72]:
year = data.value_counts(['Year']).reset_index(name='count')
year.head(20)

      Year  count
0   2006.0  15680
1   2007.0  15438
2   2005.0  14827
3   2004.0  14616
4   2003.0  14321
5   2012.0  14152
6   2013.0  14017
7   2008.0  13887
8   2011.0  13273
9   2002.0  12798
10  2010.0  12355
11  2014.0  11720
12  2015.0  11160
13  2000.0  11066
14  2001.0  11000
15  2009.0  10614
16  1999.0   8123
17  2016.0   6828
18  1998.0   6242
19  1997.0   5101

In [73]:
color = data.value_counts(['Color']).reset_index(name='count')
color

          Color  count
0         BLACK  51149
1        SILVER  45446
2         WHITE  40100
3          GRAY  27662
4           RED  20078
5          BLUE  18482
6         GREEN   9091
7          GOLD   8530
8    BLUE, DARK   5631
9           TAN   5055
10       MAROON   4497
11  BLUE, LIGHT   3470
12        BEIGE   2761
13    GREEN, DK   2727
14   GREEN, LGT   1429
15        BROWN   1275
16       YELLOW    944
17       ORANGE    724
18       BRONZE    588
19       PURPLE    525
20   MULTICOLOR    242
21        CREAM    183
22       COPPER     81
23         PINK     15
24   CAMOUFLAGE      4
25       CHROME      2

In [77]:
data['time_data'] = data['Time Of Stop'].apply(lambda x: x.split(":")[0]) #data['Time Of Stop']
time = data.value_counts(['time_data']).reset_index(name='count')
time

   time_data  count
0         23  17587
1         22  16862
2         08  15369
3         00  14616
4         01  12847
5         09  12671
6         16  12398
7         21  12173
8         10  12044
9         17  11990
10        02  10698
11        14  10614
12        11  10429
13        07  10157
14        13   9979
15        15   9671
16        12   9632
17        18   9097
18        20   8851
19        19   8120
20        03   7147
21        06   4564
22        04   4254
23        05   2488

In [78]:
data['month'] = data['Date Of Stop'].apply(lambda x: x.split("/")[0]) #data['Time Of Stop']
month = data.value_counts(['month']).reset_index(name='count')
month

   month  count
0     05  27793
1     04  27746
2     06  26522
3     10  26353
4     08  25112
5     09  24677
6     07  24001
7     11  22758
8     03  17728
9     02  10766
10    01  10728
11    12  10074